{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "0": 0,
      "1": 1,
      "00": 2,
      "11": 3,
      "01": 4,
      "011": 5,
      "001": 6,
      "0011": 7,
      "0101": 8,
      "00011": 9,
      "0001": 10,
      "0111": 11,
      "00111": 12,
      "0000": 13,
      "00101": 14,
      "001011": 15,
      "000011": 16,
      "01101": 17,
      "000111": 18,
      "000101": 19,
      "00001": 20,
      "0010011": 21,
      "01111": 22,
      "0001111": 23,
      "001111": 24,
      "0001011": 25,
      "0010101": 26,
      "001101": 27,
      "01010101": 28,
      "01001": 29,
      "000": 30,
      "000001": 31,
      "0001101": 32,
      "0000111": 33,
      "001001": 34,
      "0000011": 35,
      "0011011": 36,
      "00001111": 37,
      "010101": 38,
      "011101": 39,
      "101": 40,
      "00101011": 41,
      "00001011": 42,
      "0010111": 43,
      "01011": 44,
      "0010001": 45,
      "0000101": 46,
      "00110011": 47,
      "111": 48,
      "001110011": 49,
      "0110101": 50,
      "0011101": 51,
      "0110001": 52,
      "00110": 53,
      "01110001": 54,
      "00011011": 55,
      "1011": 56,
      "00110101": 57,
      "00101101": 58,
      "001100011": 59,
      "00011110": 60,
      "000000": 61,
      "00011101": 62,
      "00010101": 63,
      "00010111": 64,
      "00100011": 65,
      "00011111": 66,
      "0011111": 67,
      "011011": 68,
      "1111": 69,
      "00001101": 70,
      "00000111": 71,
      "011110": 72,
      "001001011": 73,
      "00100101": 74,
      "00100111": 75,
      "000110011": 76,
      "1101": 77,
      "0110011": 78,
      "00010011": 79,
      "0010": 80,
      "0010010011": 81,
      "001000011": 82,
      "00111011": 83,
      "001010101": 84,
      "001010011": 85,
      "01110000": 86,
      "000111000": 87,
      "011111": 88,
      "000010101": 89,
      "0110000": 90,
      "0010000": 91,
      "000100111": 92,
      "01110101": 93,
      "000001111": 94,
      "000110101": 95,
      "11000": 96,
      "0010101101": 97,
      "00110110011": 98,
      "00001001011": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "1"
      ],
      [
        "0",
        "1"
      ],
      [
        "0",
        "11"
      ],
      [
        "00",
        "1"
      ],
      [
        "00",
        "11"
      ],
      [
        "01",
        "01"
      ],
      [
        "00",
        "011"
      ],
      [
        "00",
        "01"
      ],
      [
        "011",
        "1"
      ],
      [
        "0011",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "001",
        "01"
      ],
      [
        "001",
        "011"
      ],
      [
        "00",
        "0011"
      ],
      [
        "011",
        "01"
      ],
      [
        "00011",
        "1"
      ],
      [
        "00",
        "0101"
      ],
      [
        "00",
        "001"
      ],
      [
        "001",
        "0011"
      ],
      [
        "011",
        "11"
      ],
      [
        "00011",
        "11"
      ],
      [
        "0011",
        "11"
      ],
      [
        "0001",
        "011"
      ],
      [
        "001",
        "0101"
      ],
      [
        "0011",
        "01"
      ],
      [
        "0101",
        "0101"
      ],
      [
        "01",
        "001"
      ],
      [
        "00",
        "0"
      ],
      [
        "00",
        "0001"
      ],
      [
        "00011",
        "01"
      ],
      [
        "00",
        "00111"
      ],
      [
        "001",
        "001"
      ],
      [
        "00",
        "00011"
      ],
      [
        "0011",
        "011"
      ],
      [
        "000011",
        "11"
      ],
      [
        "0101",
        "01"
      ],
      [
        "0111",
        "01"
      ],
      [
        "1",
        "01"
      ],
      [
        "00101",
        "011"
      ],
      [
        "00",
        "001011"
      ],
      [
        "001",
        "0111"
      ],
      [
        "01",
        "011"
      ],
      [
        "001",
        "0001"
      ],
      [
        "00",
        "00101"
      ],
      [
        "0011",
        "0011"
      ],
      [
        "11",
        "1"
      ],
      [
        "00111",
        "0011"
      ],
      [
        "011",
        "0101"
      ],
      [
        "00111",
        "01"
      ],
      [
        "011",
        "0001"
      ],
      [
        "0011",
        "0"
      ],
      [
        "0111",
        "0001"
      ],
      [
        "00011",
        "011"
      ],
      [
        "1",
        "011"
      ],
      [
        "0011",
        "0101"
      ],
      [
        "001011",
        "01"
      ],
      [
        "0011",
        "00011"
      ],
      [
        "0001111",
        "0"
      ],
      [
        "0000",
        "00"
      ],
      [
        "000111",
        "01"
      ],
      [
        "000101",
        "01"
      ],
      [
        "0001",
        "0111"
      ],
      [
        "001",
        "00011"
      ],
      [
        "0001111",
        "1"
      ],
      [
        "001111",
        "1"
      ],
      [
        "011",
        "011"
      ],
      [
        "11",
        "11"
      ],
      [
        "000011",
        "01"
      ],
      [
        "00",
        "000111"
      ],
      [
        "01111",
        "0"
      ],
      [
        "001",
        "001011"
      ],
      [
        "001",
        "00101"
      ],
      [
        "001",
        "00111"
      ],
      [
        "00011",
        "0011"
      ],
      [
        "11",
        "01"
      ],
      [
        "011",
        "0011"
      ],
      [
        "0001",
        "0011"
      ],
      [
        "001",
        "0"
      ],
      [
        "001",
        "0010011"
      ],
      [
        "001",
        "000011"
      ],
      [
        "00111",
        "011"
      ],
      [
        "0010101",
        "01"
      ],
      [
        "00101",
        "0011"
      ],
      [
        "0111",
        "0000"
      ],
      [
        "000111",
        "000"
      ],
      [
        "01111",
        "1"
      ],
      [
        "00001",
        "0101"
      ],
      [
        "011",
        "0000"
      ],
      [
        "001",
        "0000"
      ],
      [
        "0001",
        "00111"
      ],
      [
        "0111",
        "0101"
      ],
      [
        "00",
        "0001111"
      ],
      [
        "00011",
        "0101"
      ],
      [
        "11",
        "000"
      ],
      [
        "00101",
        "01101"
      ],
      [
        "0011011",
        "0011"
      ],
      [
        "00001",
        "001011"
      ]
    ]
  }
}